{"class_name": "Functional", "config": {"name": "transformer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "dec_inputs"}, "name": "dec_inputs", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "enc_padding_mask", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAczQAAAB0AKABdABqAqADfABkAaECdABqBKECfQF8AWQAZACF\nAnQAagV0AGoFZABkAIUCZgQZAFMAKQJO6QAAAAApBtoCdGbaBGNhc3TaBG1hdGjaBWVxdWFs2gdm\nbG9hdDMy2gduZXdheGlzKQLaAXjaBG1hc2upAHIKAAAA+iA8aXB5dGhvbi1pbnB1dC0xOTQtOTcw\nYzI3ZmQ4NjQ1PtoTY3JlYXRlX3BhZGRpbmdfbWFzawEAAABzBAAAAAABGAI=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [1, 1, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "enc_padding_mask", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8180, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply", "inbound_nodes": [["embedding", 0, 0, {"y": 16.0, "name": null}]]}, {"class_name": "PositionalEncoding", "config": {"name": "positional_encoding", "trainable": true, "dtype": "float32", "position": 8180, "d_model": 256}, "name": "positional_encoding", "inbound_nodes": [[["tf.math.multiply", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["positional_encoding", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "encoder_layer_0", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "MultiHeadAttention", "config": {"name": "attention", "trainable": true, "dtype": "float32", "d_model": 256, "num_heads": 8}, "name": "attention", "inbound_nodes": [{"query": ["inputs", 0, 0, {}], "key": ["inputs", 0, 0, {}], "value": ["inputs", 0, 0, {}], "mask": ["padding_mask", 0, 0, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["attention", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add", "inbound_nodes": [["inputs", 0, 0, {"y": ["dropout_1", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization", "inbound_nodes": [[["tf.__operators__.add", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["layer_normalization", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_1", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_1", "inbound_nodes": [["layer_normalization", 0, 0, {"y": ["dropout_2", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_1", "inbound_nodes": [[["tf.__operators__.add_1", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["layer_normalization_1", 0, 0]]}, "name": "encoder_layer_0", "inbound_nodes": [[["dropout", 0, 0, {}], ["padding_mask", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "encoder_layer_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "MultiHeadAttention", "config": {"name": "attention", "trainable": true, "dtype": "float32", "d_model": 256, "num_heads": 8}, "name": "attention", "inbound_nodes": [{"query": ["inputs", 0, 0, {}], "key": ["inputs", 0, 0, {}], "value": ["inputs", 0, 0, {}], "mask": ["padding_mask", 0, 0, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["attention", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_2", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_2", "inbound_nodes": [["inputs", 0, 0, {"y": ["dropout_3", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_2", "inbound_nodes": [[["tf.__operators__.add_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["layer_normalization_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_4", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_3", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_3", "inbound_nodes": [["layer_normalization_2", 0, 0, {"y": ["dropout_4", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_3", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_3", "inbound_nodes": [[["tf.__operators__.add_3", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["layer_normalization_3", 0, 0]]}, "name": "encoder_layer_1", "inbound_nodes": [[["encoder_layer_0", 1, 0, {}], ["padding_mask", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["encoder_layer_1", 1, 0]]}, "name": "encoder", "inbound_nodes": [[["inputs", 0, 0, {}], ["enc_padding_mask", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "look_ahead_mask", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABAAAAAcAAABDAAAAc0AAAAB0AKABfAChAWQBGQB9AWQBdABqAqADdACgBHwBfAFm\nAqEBZAJkA6EDGAB9AnQFfACDAX0DdACgBnwCfAOhAlMAKQRO6QEAAADp/////+kAAAAAKQfaAnRm\n2gVzaGFwZdoGbGluYWxn2gliYW5kX3BhcnTaBG9uZXPaE2NyZWF0ZV9wYWRkaW5nX21hc2vaB21h\neGltdW0pBNoBeNoHc2VxX2xlbtoPbG9va19haGVhZF9tYXNr2gxwYWRkaW5nX21hc2upAHIPAAAA\n+iA8aXB5dGhvbi1pbnB1dC0xOTctMWI5ZGE0ZjEyNzRlPtoWY3JlYXRlX2xvb2tfYWhlYWRfbWFz\nawIAAABzCAAAAAABDgEeAQgB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [1, null, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "look_ahead_mask", "inbound_nodes": [[["dec_inputs", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "dec_padding_mask", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAczQAAAB0AKABdABqAqADfABkAaECdABqBKECfQF8AWQAZACF\nAnQAagV0AGoFZABkAIUCZgQZAFMAKQJO6QAAAAApBtoCdGbaBGNhc3TaBG1hdGjaBWVxdWFs2gdm\nbG9hdDMy2gduZXdheGlzKQLaAXjaBG1hc2upAHIKAAAA+iA8aXB5dGhvbi1pbnB1dC0xOTQtOTcw\nYzI3ZmQ4NjQ1PtoTY3JlYXRlX3BhZGRpbmdfbWFzawEAAABzBAAAAAABGAI=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [1, 1, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "dec_padding_mask", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "decoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8180, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_1", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_1", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_1", "inbound_nodes": [["embedding_1", 0, 0, {"y": 16.0, "name": null}]]}, {"class_name": "PositionalEncoding", "config": {"name": "positional_encoding_1", "trainable": true, "dtype": "float32", "position": 8180, "d_model": 256}, "name": "positional_encoding_1", "inbound_nodes": [[["tf.math.multiply_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_5", "inbound_nodes": [[["positional_encoding_1", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_outputs"}, "name": "encoder_outputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "look_ahead_mask"}, "name": "look_ahead_mask", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "decoder_layer_0", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "look_ahead_mask"}, "name": "look_ahead_mask", "inbound_nodes": []}, {"class_name": "MultiHeadAttention", "config": {"name": "attention_1", "trainable": true, "dtype": "float32", "d_model": 256, "num_heads": 8}, "name": "attention_1", "inbound_nodes": [{"query": ["inputs", 0, 0, {}], "key": ["inputs", 0, 0, {}], "value": ["inputs", 0, 0, {}], "mask": ["look_ahead_mask", 0, 0, {}]}]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_4", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_4", "inbound_nodes": [["attention_1", 0, 0, {"y": ["inputs", 0, 0], "name": null}]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_outputs"}, "name": "encoder_outputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_4", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_4", "inbound_nodes": [[["tf.__operators__.add_4", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "attention_2", "trainable": true, "dtype": "float32", "d_model": 256, "num_heads": 8}, "name": "attention_2", "inbound_nodes": [{"query": ["layer_normalization_4", 0, 0, {}], "key": ["encoder_outputs", 0, 0, {}], "value": ["encoder_outputs", 0, 0, {}], "mask": ["padding_mask", 0, 0, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_6", "inbound_nodes": [[["attention_2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_5", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_5", "inbound_nodes": [["dropout_6", 0, 0, {"y": ["layer_normalization_4", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_5", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_5", "inbound_nodes": [[["tf.__operators__.add_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_20", "inbound_nodes": [[["layer_normalization_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_21", "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_7", "inbound_nodes": [[["dense_21", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_6", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_6", "inbound_nodes": [["dropout_7", 0, 0, {"y": ["layer_normalization_5", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_6", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_6", "inbound_nodes": [[["tf.__operators__.add_6", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["encoder_outputs", 0, 0], ["look_ahead_mask", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["layer_normalization_6", 0, 0]]}, "name": "decoder_layer_0", "inbound_nodes": [[["dropout_5", 0, 0, {}], ["encoder_outputs", 0, 0, {}], ["look_ahead_mask", 0, 0, {}], ["padding_mask", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "decoder_layer_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "look_ahead_mask"}, "name": "look_ahead_mask", "inbound_nodes": []}, {"class_name": "MultiHeadAttention", "config": {"name": "attention_1", "trainable": true, "dtype": "float32", "d_model": 256, "num_heads": 8}, "name": "attention_1", "inbound_nodes": [{"query": ["inputs", 0, 0, {}], "key": ["inputs", 0, 0, {}], "value": ["inputs", 0, 0, {}], "mask": ["look_ahead_mask", 0, 0, {}]}]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_7", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_7", "inbound_nodes": [["attention_1", 0, 0, {"y": ["inputs", 0, 0], "name": null}]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_outputs"}, "name": "encoder_outputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_7", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_7", "inbound_nodes": [[["tf.__operators__.add_7", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "attention_2", "trainable": true, "dtype": "float32", "d_model": 256, "num_heads": 8}, "name": "attention_2", "inbound_nodes": [{"query": ["layer_normalization_7", 0, 0, {}], "key": ["encoder_outputs", 0, 0, {}], "value": ["encoder_outputs", 0, 0, {}], "mask": ["padding_mask", 0, 0, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_8", "inbound_nodes": [[["attention_2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_8", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_8", "inbound_nodes": [["dropout_8", 0, 0, {"y": ["layer_normalization_7", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_8", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_8", "inbound_nodes": [[["tf.__operators__.add_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_30", "inbound_nodes": [[["layer_normalization_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_31", "inbound_nodes": [[["dense_30", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_9", "inbound_nodes": [[["dense_31", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_9", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_9", "inbound_nodes": [["dropout_9", 0, 0, {"y": ["layer_normalization_8", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_9", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_9", "inbound_nodes": [[["tf.__operators__.add_9", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["encoder_outputs", 0, 0], ["look_ahead_mask", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["layer_normalization_9", 0, 0]]}, "name": "decoder_layer_1", "inbound_nodes": [[["decoder_layer_0", 1, 0, {}], ["encoder_outputs", 0, 0, {}], ["look_ahead_mask", 0, 0, {}], ["padding_mask", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["encoder_outputs", 0, 0], ["look_ahead_mask", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["decoder_layer_1", 1, 0]]}, "name": "decoder", "inbound_nodes": [[["dec_inputs", 0, 0, {}], ["encoder", 1, 0, {}], ["look_ahead_mask", 0, 0, {}], ["dec_padding_mask", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "outputs", "trainable": true, "dtype": "float32", "units": 8180, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "outputs", "inbound_nodes": [[["decoder", 1, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["dec_inputs", 0, 0]], "output_layers": [["outputs", 0, 0]]}, "keras_version": "2.8.0", "backend": "tensorflow"}